Repository: tiredIsa/XrayUI-dev
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# Personalize_ImportTooltip
source: Import preset configuration
ru_ru: Импорт конфигурации

# Personalize_ExportSuccessMsgFmt
source: Exported to {0}
ru_ru: Экспортировано в {0}

# Personalize_ImportFailed
source: Import failed
ru_ru: Не удалось импортировать

# Personalize_ImportSuccess
source: Import successful
ru_ru: Импорт завершён

# Personalize_ImportSuccessMsg
source: Imported {0} nodes, {1} subscriptions, {2} rules{3}.
ru_ru: Импортировано: серверов — {0}, подписок — {1}, правил — {2}{3}.

# Personalize_ImportAdvancedSuffix
source: , including advanced routing
ru_ru: , включая расширенную маршрутизацию

# Personalize_PresetMissingTitle
source: Preset files not found
ru_ru: Файлы конфигурации не найдены

# Personalize_PresetMissingMsg
source: Please prepare servers.json / settings.json under the Import folder first.
ru_ru: Сначала поместите servers.json / settings.json в папку Import.

# ChainProxy_NameLabel.Text
source: Name
ru_ru: Название

# ChainProxy_NameBox.PlaceholderText
source: Chain proxy name
ru_ru: Название цепочки прокси

# ChainProxy_EntryLabel.Text
source: Entry proxy
ru_ru: Входной прокси

# ChainProxy_EntryBox.PlaceholderText
source: Select front node
ru_ru: Выберите входной сервер

# ChainProxy_ExitLabel.Text
source: Exit proxy
ru_ru: Выходной прокси

# ChainProxy_ExitBox.PlaceholderText
source: Select exit node
ru_ru: Выберите выходной сервер

# ChainProxy_Hint.Text
source: Traffic is forwarded through the entry proxy and routed out via the exit proxy
ru_ru: Трафик проходит через входной прокси и выходит в сеть через выходной

# ChainProxy_NameRequired
source: Please enter a chain proxy name.
ru_ru: Введите название цепочки прокси.

# ChainProxy_EntryRequired
source: Please select an entry proxy.
ru_ru: Выберите входной прокси.

# ChainProxy_ExitRequired
source: Please select an exit proxy.
ru_ru: Выберите выходной прокси.

# ChainProxy_EntryExitSame
source: Entry proxy and exit proxy cannot be the same node.
ru_ru: Входной и выходной прокси должны быть разными серверами.

# Tun_MoreOptionsBtn.Content
source: More options
ru_ru: Дополнительные параметры

# Tun_MtuLabel.Text
source: Maximum transmission unit
ru_ru: Максимальный размер пакета (MTU)

# Tun_InterfaceLabel.Text
source: Outbound interface
ru_ru: Исходящий интерфейс

# Tun_InterfaceTooltip
source: Xray picks automatically by default; only set this manually if auto mode is unavailable.
ru_ru: Xray выбирает интерфейс автоматически. Укажите его вручную, только если автоматический выбор не работает.

# Tun_AutoInterfaceLabel
source: auto (recommended)
ru_ru: Автоматически (рекомендуется)

# Tun_Ipv6Label.Text
source: Enable IPv6 address
ru_ru: Включить адрес IPv6

# Subscription_DialogTitle_Add
source: Add Subscription
ru_ru: Добавить подписку

# Subscription_DialogTitle_Manage
source: Manage Subscriptions
ru_ru: Управление подписками

# Subscription_UrlBox.Header
source: Subscription URL
ru_ru: URL подписки

# Subscription_NameBox.Header
source: Name (optional)
ru_ru: Название (необязательно)

# Subscription_NameBox.PlaceholderText
source: Leave empty to use link domain
ru_ru: Пусто — использовать домен ссылки

# Subscription_AutoImportHintText.Text
source: All nodes from the subscription will be parsed and imported automatically
ru_ru: Серверы подписки будут распознаны и импортированы автоматически.

# Subscription_EmptyText.Text
source: No subscriptions
ru_ru: Нет подписок

# Subscription_DeleteConfirmText.Text
source: Delete subscription?
ru_ru: Удалить подписку?

# Subscription_DeleteDescText.Text
source: All nodes under this subscription will also be deleted.
ru_ru: Все серверы этой подписки также будут удалены.

# Subscription_DeleteConfirmBtn.Content
source: Delete
ru_ru: Удалить

# Subscription_SaveBtn.Content
source: Save
ru_ru: Сохранить

# Xray_ExeNotFound
source: Could not find xray.exe Path: {0}
ru_ru: Не найден xray.exe Путь: {0}

# Xray_ExitedImmediately
source: xray exited immediately (exit code {0})
ru_ru: Xray завершился сразу после запуска (код {0})

# XrayLog_Started
source: [Started] {0}
ru_ru: [Запущен] {0}

# XrayLog_Config
source: [Config] {0}
ru_ru: [Конфигурация] {0}

# XrayLog_Error
source: [Error] {0}
ru_ru: [Ошибка] {0}

# XrayLog_StartFailed
source: [Error] Start failed: {0}
ru_ru: [Ошибка] Не удалось запустить: {0}

# XrayLog_Exception
source: [Exception] {0}
ru_ru: [Исключение] {0}

# XrayLog_Stopped
source: [Stopped]
ru_ru: [Остановлен]

# XrayLog_Shutdown
source: [shutdown] xray stopped
ru_ru: [Завершение] Xray остановлен

# XrayLog_ProcessExited
source: [xray process exited]
ru_ru: [Процесс Xray завершён]

# XrayLog_JobCreateFailed
source: [Warning] CreateJobObject failed (err={0}); orphan-process safety net disabled
ru_ru: [Предупреждение] Ошибка CreateJobObject ({0}); защита от оставшихся процессов отключена

# XrayLog_JobAssignFailed
source: [Warning] AssignProcessToJobObject failed (err={0}); orphan-process safety net inactive
ru_ru: [Предупреждение] Ошибка AssignProcessToJobObject ({0}); защита от оставшихся процессов не действует

# XrayLog_JobBindException
source: [Warning] Job Object bind exception: {0}
ru_ru: [Предупреждение] Ошибка привязки Job Object: {0}

# Chain_NeedServerList
source: Chain proxy needs the server list to resolve entry/exit nodes.
ru_ru: Для определения входного и выходного серверов цепочке прокси нужен список серверов.

# Chain_EndpointMissing
source: The chain proxy's entry or exit node no longer exists. Please edit the chain proxy again.
ru_ru: Входной или выходной сервер цепочки больше не существует. Измените цепочку прокси.

# Chain_NoNesting
source: A chain proxy cannot nest another chain proxy. Please choose different entry/exit nodes.
ru_ru: Цепочка прокси не может содержать другую цепочку. Выберите другие входной и выходной серверы.

# Tun_PreflightErrorTitle
source: TUN mode error
ru_ru: Ошибка режима TUN

# Tun_WintunNotFound
source: Could not find wintun.dll Path: {0}
ru_ru: Не найдена wintun.dll Путь: {0}

# ServerList_TestModeConnect.Text
source: Connection latency
ru_ru: Задержка TCP

# ServerList_TestModeReal.Text
source: Test real delay
ru_ru: Задержка подключения

# Personalize_RoutingRegionTitle.Text
source: Region
ru_ru: Регион

# Personalize_LanguageRegionExpanderAutomationName
source: Application language and region settings
ru_ru: Настройки языка и региона приложения

# Personalize_Region_CN.Content
source: China
ru_ru: Китай

# Personalize_Region_RU.Content
source: Russia
ru_ru: Россия

# Personalize_Region_IR.Content
source: Iran
ru_ru: Иран

# Personalize_RoutingRegionDesc.Text
source: Region routed setting
ru_ru: Регион прямой маршрутизации
